areiter128/DPSK3/dspic/src/app/app_test.c

/**********************************************************************
Copyright(c) 2018 Microchip Technology Inc. and its subsidiaries.
Subject to your compliance with these terms, you may use Microchip
software and any derivatives exclusively with Microchip products. It
is your responsibility to comply with third party license terms
applicable to your use of third-party software (including open source
software) that may accompany Microchip software.
THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER
EXPRESS, IMPLIED OR STATUTORY, APPLY TO THIS SOFTWARE, INCLUDING ANY
IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND FITNESS
FOR A PARTICULAR PURPOSE.
IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL,
PUNITIVE, INCIDENTAL OR CONSEQUENTIAL LOSS, DAMAGE, COST OR EXPENSE OF
ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE
FORESEEABLE. TO THE FULLEST EXTENT ALLOWED BY LAW, MICROCHIP'S TOTAL
LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO
MICROCHIP FOR THIS SOFTWARE.
**********************************************************************/

/* Including header files */
#include "stdbool.h"
#include <xc.h>
#include <float.h>
#include "misc/delay.h"
#include "device/dev_button.h"
#include "device/dev_uart1.h"
#include "misc/helpers.h"
#include "misc/global.h"
//#include "compensator.h"
#include "app/app_proto24.h"
#include "driver/power_controllers/drv_power_controllers.h"
#include "driver/power_controllers/drv_power_controller_buck_custom.h"
#include "driver/power_controllers/drv_power_controller_boost_custom.h"
#include "os/os_scheduler.h"

#define SIZE_OF(X)      (sizeof(X)/sizeof(X[0]))
#define MIN(X,Y)        (((X)<(Y))?(X):(Y))
#define MIN3(X, Y, Z)   MIN(MIN(X,Y),Z)

#define abs_dbl(x)   ((x)>=0.0)?(x):(0.0 - (x))
#define abs_s16(x)   (((x)>=0)?(x):(0 - (x)))

typedef bool     (*pftest_t)(void);
typedef uint16_t (*pfread_u16_t)(void);
typedef double   (*pfread_dbl_t)(void);


static bool testSerial(void);
static bool testP24com(void);
static bool testP24ledsUbutton(void);
static bool testP24btn1(void);
static bool testP24btn2(void);
static bool testNoLoad(void);
static bool testFullLoad(void);
static bool testStepLoad(void);
static bool testThermal(void);


static void testShowResults(uint16_t);
static bool _analizeSamples_dbl(pfread_dbl_t pFunc, double   min, double   max, double   dev, double   avg, double   err, uint16_t count);
static bool _analizeSamples_u16(pfread_u16_t pFunc, uint16_t min, uint16_t max, uint16_t dev, uint16_t avg, uint16_t err, uint16_t count);


pftest_t TestHandlers[] = { testSerial,
                            testP24com,
                            testP24ledsUbutton,
                            testP24btn1,
                            testP24btn2,
                            testNoLoad,
                            testFullLoad,
                            testStepLoad,
                            testThermal
                          };

char    *TestStrings[] = {  "PC comm",
                            "PIC24 comm",
                            "9 LEDs blinking / user button",
                            "buck load button",
                            "boost load button",
                            "regulators without load",
                            "regulators with full load",
                            "regulators with stepping load",
                            "thermal"
                         };

uint16_t  TestTimes[]  = {60, 55, 50, 45, 40, 35, 30, 25, 20};

uint32_t app_test_millisecondcounter;

#define NUM_TESTS    MIN3(SIZE_OF(TestHandlers), SIZE_OF(TestStrings), SIZE_OF(TestTimes))

//#define DELAY_ADJ_FACTOR      0.27
//#define DELAY_MS_ADJUSTED(x)  __delay_ms((unsigned long)(x * DELAY_ADJ_FACTOR))

void WaitMilliseconds(uint16_t ms);

void App_Test(void)
{
    uint16_t results = UINT16_MAX;
    uint8_t  i;
        
    PrintLcd(0,"DPSK TESTING... ");    
    PrintLcd(1,"                ");
    PrintSerial("=============================================================\n\r");
    PrintSerial("DURING TEST, DO NOT PRESS ANY BUTTONS ON DPSK,\n\r");
    PrintSerial("EXCEPT FOR THE EXPLICIT SITUATIONS\n\r");
    
    for(i = 0; i < NUM_TESTS; i++)
    {
        PrintSerial("***********************************************************\n\r");
        PrintSerial("%d/%d Testing %s - estimated remaining time %d s\n\r", i+1, NUM_TESTS, TestStrings[i], TestTimes[i]);
        if(TestHandlers[i]())
        {
            PrintSerial(" Failed!\n\r");
        }
        else
        {
            PrintSerial(" PASSED\n\r");
            results &= ~(1<<i);
        }
    }
    PrintSerial("=============================================================\n\r");
    testShowResults(results);
    PrintSerial("THE END\n\r");
    PrintSerial("=============================================================\n\r");
    WaitMilliseconds(500);
}

bool Proto24Check(void)
{
    App_Proto24_Task_1ms();
    if(App_Proto24_IsNewDataAvailable())
    {
        App_Proto24_GetData(&global_proto24data);
        Global_UpdateProto24Data();
        return true;
    }
    else return false;
}

static void testShowResults(uint16_t results)
{
    uint8_t i, errors = 0;
    PrintSerial("RESULTS 0x%04X\n\r", results);
    for(i = 0; i < NUM_TESTS; i++)
    {
        char *testResult;
        if(results & (1<<i)) {
            errors++;
            testResult = "FAILED";
        } else {
            testResult = "PASSED";
        }
        PrintSerial("Test no. %d - %s - %s\n\r", i + 1, testResult, TestStrings[i]);
        WaitMilliseconds(5);    // wait for serial buffer to get empty
    }
    if(errors)
        PrintSerial("%d tests failed\n\r", errors);
    else
        PrintSerial("***** SUCCESS! *****\n\r");
}

static bool _waitSpecificKey(char *pString, uint16_t timeout)
{
    // ret 'true'  for timeout 
    // ret 'false' for success
    bool ret_code = true;
    timeout = timeout >> 4; // divide it by 16
    do
    {
        WaitMilliseconds(16);
        if(!Dev_UART1_ReceiveBufferIsEmpty())
        {
            char ch = (char)Dev_UART1_Read();
            char *ptr;
            for(ptr = pString; '\0' != *ptr; ptr++)
            {
                if(*ptr == ch)
                {
                    ret_code = false;
                    break;
                }
            }
        }
        if(false == ret_code)
            break;
    } while(timeout--);
    return ret_code;
}


static bool testSerial(void)
{
    bool ret_code = true; // true means failed
    PrintSerial("Press 'y' or 'Y' to continue (timeout 5s) ");
    ret_code = _waitSpecificKey("yY", 5000);
    return ret_code;
}

static bool testP24ledsUbutton(void)
{
    bool ret_code = true; // true means failed
    uint8_t timeout_counter = 200; // it takes around 10s
    uint8_t btn_count = 0;
    PrintSerial(" if ALL 9 LEDs are blinking, ");
    PrintSerial("press user button 3 times (timeout 10s) ");
    App_Proto24_Init();
    App_Proto24_Send(PROTO_SYS_RESET);
    WaitMilliseconds(600);
    App_Proto24_Send(PROTO_TEST_ON);

    while(timeout_counter--)
    {
        WaitMilliseconds(50);
        Proto24Check();
        if(DEV_BUTTON_EVENT_PRESSED_SHORT == Dev_Button_GetEvent())
        {
            btn_count++;
            PrintSerial(".");
                if(btn_count > 2)
                {
                    ret_code = false;
                    break;
                }
        }
    }
    App_Proto24_Send(PROTO_TEST_OFF);
    WaitMilliseconds(50);
    return ret_code;
}

static bool testP24btn1(void)
{
    bool ret_code = true; // true means failed
    uint8_t timeout_counter = 100; // it takes around 5s
//    Proto24Init(pProto);
//    Proto24Send(PROTO_SYS_RESET);
//    WaitMilliseconds(600);
    PrintSerial("press BUCK LOAD button 3 times (timeout 5s) ");

    while(timeout_counter--)
    {
        WaitMilliseconds(50);
        Proto24Check();
        if(global_proto24data.load_status.buck_still == 7)
        {
            PrintSerial(" pressed 3 times ");
            ret_code = false;
            break;
        }
    }
  //  Proto24Send(PROTO_SYS_RESET);
  //  WaitMilliseconds(100);
    return ret_code;
}

static bool testP24btn2(void)
{
    bool ret_code = true; // true means failed
    uint8_t timeout_counter = 100; // it takes around 5s
    App_Proto24_Init();
 //   Proto24Send(PROTO_SYS_RESET);
 //   WaitMilliseconds(600);
    PrintSerial("press BOOST LOAD button 3 times (timeout 5s) ");

    while(timeout_counter--)
    {
        WaitMilliseconds(50);
        Proto24Check();
        if(global_proto24data.load_status.boost_still == 7)
        {
            PrintSerial(" pressed 3 times ");
            ret_code = false;
            break;
        }
    }
    App_Proto24_Send(PROTO_SYS_RESET);
    WaitMilliseconds(100);
    return ret_code;
}



static bool testNoLoad(void)
{
    bool ret_code; // true means failed
    /*                       pFunc,        min,  max,  dev,  avg,  err,  count */
//bool _analizeSamples_dbl(pfread_dbl_t pFunc, double min, double max, double dev, double avg, double err, uint16_t count)
    
    ret_code = 0;
    PrintSerial("\n\rinput voltage: ");
    if(_analizeSamples_dbl(Drv_PowerControllers_GetInputVoltage, 6.0, 14.0, 2.0, 9.0, 0.6, 100))
    {   PrintSerial(" !");  ret_code |= 1;  }
    PrintSerial("\n\rbuck voltage:  ");
    if(_analizeSamples_dbl(Drv_PowerControllerBuck1_GetOutputVoltage, 3.0, 3.5, 1.0, 3.3, 0.2, 100))
    {   PrintSerial(" !");  ret_code |= 1;  }
    PrintSerial("\n\rboost voltage: ");
    if(_analizeSamples_dbl(Drv_PowerControllerBoost1_GetOutputVoltage, 14.4, 15.4, 1.0, 15.0, 0.3, 100))
    {   PrintSerial(" !");  ret_code |= 1;  }
    PrintSerial("\n\rbuck DAC:      ");
    if(_analizeSamples_u16(GetDacBuck, 0, 300, 200, 50, 40, 100))
    {   PrintSerial(" !");  ret_code |= 1;  }
    PrintSerial("\n\rboost DAC:     ");
    if(_analizeSamples_u16(GetDacBoost, 800, 1800, 300, 1500, 400, 100))
    {   PrintSerial(" !");  ret_code |= 1;  }
    PrintSerial("\n\r");
    return ret_code;
}

static bool testFullLoad(void)
{
    bool ret_code; // true means failed
    App_Proto24_Init();
    App_Proto24_Send(PROTO_SYS_RESET);    WaitMilliseconds(600);
    App_Proto24_Send(PROTO_SHORT_BUCK);   WaitMilliseconds(200);
    App_Proto24_Send(PROTO_SHORT_BOOST);  WaitMilliseconds(200);
    App_Proto24_Send(PROTO_SHORT_BUCK);   WaitMilliseconds(200);
    App_Proto24_Send(PROTO_SHORT_BOOST);  WaitMilliseconds(200);
    App_Proto24_Send(PROTO_SHORT_BUCK);   WaitMilliseconds(200);
    App_Proto24_Send(PROTO_SHORT_BOOST);  WaitMilliseconds(500);

    ret_code = 0;
    /*                       pFunc,        min,  max,  dev,  avg,  err,  count */
    PrintSerial("\n\rinput voltage: ");
    if(_analizeSamples_dbl(Drv_PowerControllers_GetInputVoltage, 6.0, 14.0, 2.0, 9.0, 0.6, 100))
    {   PrintSerial(" !");  ret_code |= 1;  }
    PrintSerial("\n\rbuck voltage:  ");
    if(_analizeSamples_dbl(Drv_PowerControllerBuck1_GetOutputVoltage, 3.0, 3.5, 1.0, 3.3, 0.2, 100))
    {   PrintSerial(" !");  ret_code |= 1;  }
    PrintSerial("\n\rboost voltage: ");
    if(_analizeSamples_dbl(Drv_PowerControllerBoost1_GetOutputVoltage, 14.4, 15.4, 1.0, 15.0, 0.3, 100))
    {   PrintSerial(" !");  ret_code |= 1;  }
    PrintSerial("\n\rbuck DAC:      ");
    if(_analizeSamples_u16(GetDacBuck, 2000, 2600, 300, 2400, 100, 100))
    {   PrintSerial(" !");  ret_code |= 1;  }
    PrintSerial("\n\rboost DAC:     ");
    if(_analizeSamples_u16(GetDacBoost, 2000, 2900, 300, 2500, 300, 100))
    {   PrintSerial(" !");  ret_code |= 1;  }
    PrintSerial("\n\r");
    App_Proto24_Send(PROTO_SYS_RESET);   WaitMilliseconds(500);
    return ret_code;
}

static bool testStepLoad(void)
{
    bool ret_code; // true means failed
    App_Proto24_Init();
    App_Proto24_Send(PROTO_SYS_RESET);    WaitMilliseconds(1000);
    App_Proto24_Send(PROTO_LONG_BUCK);    WaitMilliseconds(500);
    App_Proto24_Send(PROTO_SHORT_BUCK);   WaitMilliseconds(200);
    App_Proto24_Send(PROTO_SHORT_BUCK);   WaitMilliseconds(200);
    App_Proto24_Send(PROTO_LONG_BOOST);   WaitMilliseconds(500);
    App_Proto24_Send(PROTO_SHORT_BOOST);  WaitMilliseconds(200);
    App_Proto24_Send(PROTO_SHORT_BOOST);  WaitMilliseconds(500);

    ret_code = 0;
    /*                      pFunc,        min,  max,  dev,  avg,  err,  count */
    PrintSerial("\n\rinput voltage: ");
    if(_analizeSamples_dbl(Drv_PowerControllers_GetInputVoltage, 6.0, 14.0, 2.0, 9.0, 0.6, 100))
    {   PrintSerial(" !");  ret_code |= 1;  }
    PrintSerial("\n\rbuck voltage:  ");
    if(_analizeSamples_dbl(Drv_PowerControllerBuck1_GetOutputVoltage, 3.0, 3.5, 1.0, 3.3, 0.2, 100))
    {   PrintSerial(" !");  ret_code |= 1;  }
    PrintSerial("\n\rboost voltage: ");
    if(_analizeSamples_dbl(Drv_PowerControllerBoost1_GetOutputVoltage, 14.4, 15.4, 1.0, 15.0, 0.3, 100))
    {   PrintSerial(" !");  ret_code |= 1;  }
    PrintSerial("\n\rbuck DAC:      ");
    if(_analizeSamples_u16(GetDacBuck, 0, 2700, 2700, 1300, 600, 100))
    {   PrintSerial(" !");  ret_code |= 1;  }
    PrintSerial("\n\rboost DAC:     ");
    if(_analizeSamples_u16(GetDacBoost, 800, 2900, 1200, 2200, 500, 100))
    {   PrintSerial(" !");  ret_code |= 1;  }
    PrintSerial("\n\r");
    App_Proto24_Send(PROTO_SYS_RESET);    WaitMilliseconds(500);
    return ret_code;
}



static bool _analizeSamples_dbl(pfread_dbl_t pFunc, double min, double max, double dev, double avg, double err, uint16_t count)
{
    bool ret_code = true; // true means failed
    double min_val, max_val, avg_val;
    uint16_t samples = 0;
    
    min_val =  FLT_MAX;
    max_val = -FLT_MAX;
    avg_val = 0;

    while(count--)
    {
        double val;
        WaitMilliseconds(11);
        val = pFunc();
        if(val < min_val)
            min_val = val;
        if(val > max_val)
            max_val = val;
        avg_val = avg_val + val;
        samples++;
    }
    avg_val = avg_val / samples;
    PrintSerial("min=%2.3f, max=%2.3f, dev=%2.3f, avg=%2.3f", min_val, max_val, max_val-min_val, avg_val);
    
    if(max_val <= max)
    {
        if(min_val >= min)
        {
            if((max_val - min_val) <= dev)
            {
                if(abs_dbl(avg_val - avg) <= err)
                {
                    ret_code = false;
                }
            }
        }
    }
    return ret_code;
}

static bool _analizeSamples_u16(pfread_u16_t pFunc, uint16_t min, uint16_t max, uint16_t dev, uint16_t avg, uint16_t err, uint16_t count)
{
    bool ret_code = true; // true means failed
    uint16_t min_val, max_val;
    uint32_t avg_val;
    uint16_t samples = 0;
    
    min_val = UINT16_MAX;
    max_val = 0;
    avg_val = 0;

    while(count--)
    {
        uint16_t val;
        WaitMilliseconds(11);
        val = pFunc();
        if(val < min_val)
            min_val = val;
        if(val > max_val)
            max_val = val;
        avg_val = avg_val + val;
        samples++;
    }
    avg_val = avg_val / samples;
    PrintSerial("min=%d, max=%d, dev=%d, avg=%d", min_val, max_val, max_val-min_val, (int)avg_val);
    
    if(max_val <= max)
    {
        if(min_val >= min)
        {
            if((max_val - min_val) <= dev)
            {
                int16_t s16_temp = avg_val - avg;
                if(abs_s16(s16_temp) <= (int16_t)err)
                {
                    ret_code = false;
                }
            }
        }
    }
    return ret_code;
}


static bool testP24com(void)
{
    bool ret_code = true;               // true means failed
    uint8_t timeout_counter = 100;      // it takes around 5s

    while(timeout_counter--)
    {
        WaitMilliseconds(50);
    }
    PrintSerial("received %d packets", global_data.pic24_packet_counter);
    if (global_data.pic24_packet_counter > 3)
        ret_code = false;
    return ret_code;
}

static uint8_t _readTemperature(void)
{
    uint8_t temperature = 255; // undefined temp
    uint8_t timeout_counter = 30; // 1.5 seconds timeout
    
    uint8_t proto24_packet_counter = global_data.pic24_packet_counter;
        
    while(timeout_counter--)
    {
        WaitMilliseconds(50);
        if (global_data.pic24_packet_counter != proto24_packet_counter) //did we receive a new temperature information?
        {
            temperature = global_data.board.temperature;
            break;
        }
    }
    return temperature;
}

static bool testThermal(void)
{
    bool ret_code = true; // true means failed
    uint8_t temp0 = 0, temp1 = 0, temp2 = 0;
    
    temp0 = _readTemperature();
//    temp0 = global_data.board.temperature;
    if(temp0 == 255)
        goto exit;
    PrintSerial("initial temperature = %d deg C", temp0);
    if(temp0 > 40)
    {
        PrintSerial("\n\rWARNING! Board is too hot, temperature test may fail. ");
        PrintSerial("Cool it down and repeat the test.");
    }

    App_Proto24_Init();
    App_Proto24_Send(PROTO_SYS_RESET);    WaitMilliseconds(600);
    App_Proto24_Send(PROTO_SHORT_BUCK);   WaitMilliseconds(200);
    App_Proto24_Send(PROTO_SHORT_BOOST);  WaitMilliseconds(200);
    App_Proto24_Send(PROTO_SHORT_BUCK);   WaitMilliseconds(200);
    App_Proto24_Send(PROTO_SHORT_BOOST);  WaitMilliseconds(200);
    App_Proto24_Send(PROTO_SHORT_BUCK);   WaitMilliseconds(200);
    App_Proto24_Send(PROTO_SHORT_BOOST);  WaitMilliseconds(500);

    temp1 = _readTemperature();
    if(temp1 == 255)
        goto exit;

    PrintSerial("\n\rtemperature 1 = %d deg C\n\r", temp1);
    PrintSerial("... heating 15s ...\n\r");
    WaitMilliseconds(15000);
    temp2 = _readTemperature();
    if(temp2 == 255)
        goto exit;

    PrintSerial("temperature 2 = %d deg C\n\r", temp2);
    if((temp2 - temp1) >= 5)
        ret_code = false;
exit:
    App_Proto24_Send(PROTO_SYS_RESET);    WaitMilliseconds(500);
    return ret_code;
}


void WaitMilliseconds(uint16_t time_ms)
{
    app_test_millisecondcounter = 0;
    while (app_test_millisecondcounter < time_ms)
    {
        OS_Scheduler_RunOnce();
    }
}
